const printMessage = require('./index.js')

// eslint-disable-next-line no-undef
test('It shoud be print "Hello"', () => {
  // eslint-disable-next-line no-undef
  expect(
    printMessage(
      '👇🤜👇👇👇👇👇👇👇👉👆👈🤛👉👇👊👇🤜👇👉👆👆👆👆👆👈🤛👉👆👆👊👆👆👆👆👆👆👆👊👊👆👆👆👊'
    )
  ).toBe('Hello')
})

// eslint-disable-next-line no-undef
test.skip('It shoud be print "Hello World"', () => {
  // eslint-disable-next-line no-undef
  expect(
    printMessage(
      '👉👆👆👆👆👆👆👆👆🤜👇👈👆👆👆👆👆👆👆👆👆👉🤛👈👊👉👉👆👉👇🤜👆🤛👆👆👉👆👆👉👆👆👆🤜👉🤜👇👉👆👆👆👈👈👆👆👆👉🤛👈👈🤛👉👇👇👇👇👇👊👉👇👉👆👆👆👊👊👆👆👆👊👉👇👊👈👈👆🤜👉🤜👆👉👆🤛👉👉🤛👈👇👇👇👇👇👇👇👇👇👇👇👇👇👇👊👉👉👊👆👆👆👊👇👇👇👇👇👇👊👇👇👇👇👇👇👇👇👊👉👆👊👉👆👊'
    )
  ).toBe('Hello World!')
})
